# -*- coding: utf-8 -*-
"""
Created on Fri Dec  7 20:46:34 2018

@author: Home love
"""
"""
def 函示名稱(參數名稱=預設資料):
    函示內部的程式碼
    return #結束函式,回傳None
    return 資料 #結束函示,回傳「資料」
    
def 函式名稱(名稱1,名稱2):
    函式內部程式碼     
#呼叫函式,以參數名稱對應資料
函式名稱(名稱2=5,名稱1=6)

def 函式名稱(*無限參數):
    無限參數以Tuple資料形態處理
    函式內部的程式碼
#呼叫函式,可傳入無線數量的參數
函式名稱(資料一,資料二,資料三)

"""
#############################################################################
def sayHello():
     print("Hello")
     
sayHello() #呼叫函示

#############################################################################
def say(msg):
     print(msg)

say('hi jimmy')

#############################################################################
def add(n1,n2):
     rs=n1-n2
     print(rs)
     
add(20,50) #得-30
add(n2=20,n1=50) #得30

#############################################################################
def sayy(msg):
     print(msg)
     return

value=sayy("Hello guys")
print(value)

#############################################################################
def addd(n1,n2):
     rst=n1+n2
     return rst

value=addd(4,5)
print(value)

#############################################################################
def multiply(n1,n2):
     print(n1*n2)
     
multiply(3,7)
multiply(8,20)

#############################################################################
def mlp(n1,n2):
     return n1*n2
value=mlp(4,5)+mlp(30,8)+mlp(17,3)+mlp(60,10) #(4*5)+(30*8)+(17*3)+(60*10)
print(value)

#############################################################################
#函示可用來做程式的包裝,同樣的邏輯可以重複利用 
def calculate(max):
     sum = 0
     for x in range(1,max+1):
          sum=sum+x
     print(sum)
     
calculate(10)
calculate(20)
calculate(30)

#############################################################################
#函式接受無限不定/參數 msgs
def say(*msgs):
     #以Tuple的方式處理
     for msg in msgs:
          print(msg)
          
say('hi','Jimmy','Bella')

#############################################################################
#數字的開方
def power(base,exp=0):
     print(base**exp)
power(3,2)
power(4)
#############################################################################
#用Tuple(迴圈)算平均數
def avg(*ns):
     sum=0
     for n in ns:
          sum=sum+n
     print(sum/len(ns))
avg(3,87)
avg(1,2,3,6,4,5,8,9,1,5)
avg(1234,648,3245)
