# -*- coding: utf-8 -*-
"""
Created on Tue Dec  4 11:54:46 2018

@author: Home love

一個等號是賦值
a = 3
兩個等號是判斷是否相等，返回True或False
3 == 3

n+=1
上面的意思是
n=n+1
"""
#if判斷式的用法
x=input('請輸入數字:') #取得字串形式的使用者輸入
x=int(x) #將字串型態轉換成數字型態
if x>=500:
     print('大於500元,收稅4%\n加收稅後金額為=',x+x*0.04)
elif x>=400:
     print('大於等於400元,小於500元,收稅3%\n加收稅後金額為=',x+x*0.03)
elif x>=300:
     print('大於等於300元,小於400元,收稅2%\n加收稅後金額為=',x+x*0.02)
elif x>=200:
     print('大於等於200元,小於300元,收稅1%\n加收稅後金額為=',x+x*0.01)
else:
     print('小於200元,免稅\n金額為=',x)
     
#############################################################################     
#四則運算

n1=int(input('請輸入數字一:'))
n2=int(input('請輸入數字二:'))
#print(n1+n2)
op=input('請輸入運算符號 +, -, *, / :')
if op =="+":
     print(n1+n2)
elif op =="-":
     print(n1-n2)
elif op =="*":
     print(n1*n2)
elif op =="/":
     print(n1/n2)
else:
     print('不支援的運算')
     
#############################################################################    
#while迴圈 
#基礎迴圈
n=1
#while True:
while n<=5:
     print('變數n的資料是:',n)
     n+=1

#############################################################################
#累加 1+2+3+4+....+10     
n=1
sum=0 #紀錄累加的結果
while n<=10:
     sum+=n
     n+=1
print(sum)     
     
#############################################################################     
#for迴圈
#for 變數名稱 in 列表或字串:
#    將列表中的項目或字串中的字源逐一取出,逐一處理
#基礎迴圈
for x in [4,1,2]:
     print('逐一取得列表中的資料:',x)
     
#############################################################################     
#使用range()
#for 變數名稱 in range(3):
#相當於
#for 變數名稱 in [0,1,2]:     
#累加 1+2+3+4+....+10
sum=0
for x in range(1,11):
     sum+=x
print(sum)

#for 變數名稱 in range(3,6):
     #相當於
#for 變數名稱 in [3,4,5]:
     
#############################################################################     
#迴圈進階控制
#強制結束迴圈
n=0
while n<5:
     if n==3:
          break
     print(n) #印出迴圈中的n
     n+=1
print('最後的 n:',n)

#############################################################################
#強制進行下一圈
n=0
for x in [0,1,2,3]:
     if x%2==0:
          continue
     print(x)
     n+=1
print('最後的n:',n)


#############################################################################
#else
n=1
while n<5:
     print('變數n的資料是:',n)
     n+=1
else:
     print(n)
     
#############################################################################     
for c in "hello":
     print("逐一取得字串中的字元",c)
else:
     print(c)
     
#############################################################################     
sum=0
for n in range(11):
     sum+=n
else:
     print(sum)

#############################################################################
#綜合範例:找出平方根
#請輸入9 得到3
#輸入11 得到[沒有]整數的平方根
n=input("輸入一個正整數:")
n=int(n)
for i in range(n):
     if i*i==n:
          print("整數平方根",i)
          break
else:
     print("沒有整數平方根")