# -*- coding: utf-8 -*-
"""
Created on Wed Nov 14 17:22:21 2018

@author: Home love
"""

"""

title()—讓第一個字大寫
upper()—讓全部變大寫
lower()—讓全部變小寫
len()—計算長度
\n—換行
\t —空格
lstrip()刪除左邊空白、
rstrip()刪除右邊空白
strip()刪除兩邊空白
#  註釋
append()方法是從串列尾端新增一個元素進去
insert()方法是可以在串列的任一位置新增元素，用法是指定插入新元素的索引值位置和值即可
del陳述句 知道元素是在哪一個位置(索引值)，就可以使用del陳述句來刪除元素
pop()方法就是把堆疊最頂端的東西彈出來，堆疊的最頂端是最後加進去的元素，也就是說pop()方法是刪除串列尾端的項目
remove()有時候我們不知道元素的索引值是多少但又想要刪除它的時候，我們可以使用remove()方法，它是一個可以依據值來刪除元素的方法
sort()方法可以讓串列按字母順序排序，但是是永久性的改變排列順序
sorted()方法跟sort()方法很像，不過sorted()方法是可以暫時性的改變排列順序，不會影響原串列的排列順序
reverse()方法是可以反轉串列原本的順序，但它也是永久性的改變

"""